Reports/РасчетнаяВедомостьОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>РасчетнаяВедомостьОрганизации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоСотрудникиИнвалиды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоСотрудникиПенсионеры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпрУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКодПоДРФО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбособленныеПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатУпр</Name>
					<Comment>в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДнейЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаДнейЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаЧасовЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеУпр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремениДляСредней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремениДляСредней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПериодРасчетаСреднегоЗаработкаКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаменаФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаменаПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаменаВидРасчета</Name>
					<Comment>если не заполнен, значи это не замена</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаменаКоличествоСтавок</Name>
					<Comment>если не заполнен, значи это не замена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДополнительныеДанные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПериодРасчетаСреднегоЗаработкаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаменыОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Comment>Документ, который зарегистрировал сторнируемое начисление</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:DocumentRef.НевыходыИОдноразовыеВыплатыВОрганизациях</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаписейРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.Сторнирование</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтпускаРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Comment>Это либо Сотрудник, либо Внутренний совместитель, либо Сотрудник которого Заменяем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Enums/ВидыЗанятостиВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыЗанятостиВОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/РасчетнаяВедомостьОрганизации/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ТолькоЗаголовок = Ложь) Экспорт
	
	ДокументРезультат.Очистить();
	
	Макет = ПолучитьМакет("Макет");
	// 37490 <<
	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
	ЗаголовокОтчета = Макет.ПолучитьОбласть("Заголовок");
	ЗаголовокОтчета.Параметры.Период = НСтр("ru='Период: ';uk='Період: '", КодЯзыкаПечать) + ПредставлениеПериода(НачалоМесяца(Период), КонецМесяца(Период), "Л="+Локализация.ОпределитьКодЯзыкаДляФормат(Локализация.КодЯзыкаИнтерфейса())+"; ФП = Истина");
	Если ПостроительОтчета.Отбор.Организация.Использование Тогда
		ЗаголовокОтчета.Параметры.Организация = НСтр("ru='Организация: ';uk='Організація: '", КодЯзыкаПечать) + ПостроительОтчета.Отбор.Организация.Значение;
	КонецЕсли;
	
	Если ТолькоЗаголовок Тогда
		ДокументРезультат.Вывести(ЗаголовокОтчета);
		Возврат;
	КонецЕсли;
	
	ПостроительОтчета.МакетЗаголовкаОтчета = ЗаголовокОтчета;
                                                                
	ПостроительОтчета.Параметры.Вставить("Период", Период);
	ПостроительОтчета.Параметры.Вставить("СледующийПериод", НачалоМесяца(КонецМесяца(Период)+1));
	
	МассивВидЗанятости    = Новый Массив(2);
	МассивВидЗанятости[0] = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы;
	МассивВидЗанятости[1] = Перечисления.ВидыЗанятостиВОрганизации.Совместительство;
	
	ПостроительОтчета.Параметры.Вставить("ПарамОсновнойСотрудник",   МассивВидЗанятости);
	
	ПостроительОтчета.Выполнить();
	ПостроительОтчета.ОформитьМакет();
	ПостроительОтчета.Вывести(ДокументРезультат);
	
	Ширина = ДокументРезультат.ШиринаТаблицы;
	ВысотаЗаголовка = 4;
	
	// удалим из документа итог по строкам - последняя колонка отчета
	Область = ДокументРезультат.Область(, Ширина, ВысотаЗаголовка + 1, Ширина);
	ДокументРезультат.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	
    Если ДокументРезультат.Область(ВысотаЗаголовка + 1, Ширина - 2, ВысотаЗаголовка + 1, Ширина - 2).Текст = "Я" Тогда
		// удалим из документа колонку "Я", соответствующую виртуальному виду расчета "Конечное сальдо" 
		Область = ДокументРезультат.Область(, Ширина - 2, ВысотаЗаголовка + 1, Ширина - 2);
		ДокументРезультат.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		
		Область = ДокументРезультат.Область(, Ширина - 2, ВысотаЗаголовка + 1, Ширина );
		Область.Разгруппировать();
		
	КонецЕсли;

	Если ДокументРезультат.Область(ВысотаЗаголовка + 1, Ширина - 3, ВысотаЗаголовка + 1, Ширина - 3).Текст = "Я" Тогда
		// удалим из документа колонку "Я", соответствующую виртуальному виду расчета "Конечное сальдо" 
		Область = ДокументРезультат.Область(, Ширина - 3, ВысотаЗаголовка + 1, Ширина - 3);
		ДокументРезультат.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		
		Область = ДокументРезультат.Область(, Ширина - 3, ВысотаЗаголовка + 1, Ширина );
		Область.Разгруппировать();
		
	КонецЕсли;
	
	Если ДокументРезультат.Область(ВысотаЗаголовка + 1, Ширина - 4, ВысотаЗаголовка + 1, Ширина - 4).Текст = "Я" Тогда
		// удалим из документа колонку "Я", соответствующую виртуальному виду расчета "Конечное сальдо" 
		Область = ДокументРезультат.Область(, Ширина - 3, ВысотаЗаголовка + 1, Ширина - 3);
		Область.Разгруппировать();
		Область = ДокументРезультат.Область(, Ширина - 4, ВысотаЗаголовка + 1, Ширина - 4);
		ДокументРезультат.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		Область = ДокументРезультат.Область(, Ширина - 3, ВысотаЗаголовка + 1, Ширина - 3);
		ДокументРезультат.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;

	
	Если ДокументРезультат.Область(ВысотаЗаголовка + 1, 3, ВысотаЗаголовка + 1, 3).Текст = "А" Тогда
		// удалим из документа колонку "А", соответствующую виртуальному виду расчета "Начальное сальдо" 
		Область = ДокументРезультат.Область(, 4, ВысотаЗаголовка + 1, 4);
		Область.Разгруппировать();
		Область = ДокументРезультат.Область(, 3, ВысотаЗаголовка + 1, 3);
		Область.Разгруппировать();
		ДокументРезультат.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				
	КонецЕсли; 
	
	Если ПостроительОтчета.Отбор.Организация.Использование = Истина  И  УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ВыводитьПодписиОтветственныхЛицВОтчетеРасчетнаяВедомостьОрганизации") Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("СтруктурнаяЕдиница", ПостроительОтчета.Отбор.Организация.Значение);
		ТЗ = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(КонецМесяца(Период), СтруктураОтбора);
		Директор = "";
		ГлБух = "";
		Для Каждого Строка ИЗ ТЗ Цикл
			Если Строка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда
				Директор = Строка.ФизическоеЛицо
			КонецЕсли;
			
			Если Строка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда
				ГлБух = Строка.ФизическоеЛицо
			КонецЕсли;
		КонецЦикла;	
	
		ПодписиОтветственных = Макет.ПолучитьОбласть("ПодписиОтветственных");
		ПодписиОтветственных.Параметры.ФИОДиректор = Директор;
		ПодписиОтветственных.Параметры.ФИОГлБух = ГлБух;
		ДокументРезультат.Присоединить(ПодписиОтветственных);
	
	КонецЕсли;

	
КонецПроцедуры

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	// 37490 <<
	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	// 37490 >>
	
	ПостроительОтчета.Текст = 
	"ВЫБРАТЬ Разрешенные 
	|	Данные.Организация,
	|	"+?(НеВыводитьПодразделение,"","РаботникиОрганизаций.Подразделение	КАК Подразделение,")+"
	|	Данные.Сотрудник КАК ФизЛицо,
	|	"+?(Не ВыводитьКодПоДРФО,"","ВЫРАЗИТЬ(""("" + Данные.Сотрудник.Физлицо.КодПоДРФО + "")"" КАК СТРОКА(20)) КАК КодПоДРФО,")+"
	|	Данные.Организация.Представление 							КАК ОрганизацияПредставление,
	|	Данные.Сотрудник.ФизЛицо.Представление						КАК ФизЛицоПредставление,
	|	Данные.Группа,
	|	Данные.ПриоритетГруппы 										КАК ПриоритетГруппы,
	|	Данные.ИмяВидаРасчета,
	|	Данные.ПриоритетВидаРасчета 								КАК ПриоритетВидаРасчета,
	|	СУММА(Данные.Результат) 									КАК Результат										
	|
	|
	|ИЗ
	|
	|	(ВЫБРАТЬ
	|		ОсновныеНачисленияРаботниковОрганизации.Организация 	КАК Организация,
	|		ОсновныеНачисленияРаботниковОрганизации.Сотрудник 			КАК Сотрудник,
	|		ОсновныеНачисленияРаботниковОрганизации.ВидРасчета          КАК ИмяВидаРасчета,
	|		"""+НСтр("ru='Начислено';uk='Нараховано'", КодЯзыкаПечать)+"""					КАК ПриоритетВидаРасчета,
	|		"""+НСтр("ru='Всего начислено';uk='Всього нараховано'", КодЯзыкаПечать)+"""		КАК Группа,
	|		2 															КАК ПриоритетГруппы,
	|		"+?(УпрУчет,"ОсновныеНачисленияРаботниковОрганизации.РезультатУпр","ОсновныеНачисленияРаботниковОрганизации.Результат")+" 			КАК Результат
	|	ИЗ
	|		РегистрРасчета.Начисления КАК ОсновныеНачисленияРаботниковОрганизации
	|	
	|	ГДЕ
	|		(ОсновныеНачисленияРаботниковОрганизации.ПериодРегистрации = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)) И
	|		("+?(УпрУчет,"ОсновныеНачисленияРаботниковОрганизации.РезультатУпр","ОсновныеНачисленияРаботниковОрганизации.Результат")+"<>0)
	//---------------------НДФЛ-------------------------------------------------------------------
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзаиморасчетыПоНДФЛ.Организация,
	|		ВзаиморасчетыПоНДФЛ.Сотрудник,
	|	ВЫБОР 
	| 	КОГДА ВзаиморасчетыПоНДФЛ.ДоходНДФЛ.ВидСтавкиВоенныйСбор = ВзаиморасчетыПоНДФЛ.ВидСтавки
	|		ТОГДА """+НСтр("ru='Военный сбор';uk='Військовий збір'", КодЯзыкаПечать)+"""
	|		ИНАЧЕ """+НСтр("ru='НДФЛ';uk='ПДФО'", КодЯзыкаПечать)+"""
	|	КОНЕЦ,
   	|		"""+НСтр("ru='НДФЛ';uk='ПДФО'", КодЯзыкаПечать)+""",
	|		"""+НСтр("ru='Всего удержано';uk='Всього утримано'", КодЯзыкаПечать)+""",
	|		3,
	|		"+?(УпрУчет,"ВзаиморасчетыПоНДФЛ.НалогУпр","ВзаиморасчетыПоНДФЛ.Налог")+"									
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыПоНДФЛ КАК ВзаиморасчетыПоНДФЛ
	|	
	|	ГДЕ
	|		(ВзаиморасчетыПоНДФЛ.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)) И
	|		(ВзаиморасчетыПоНДФЛ.Сотрудник ССЫЛКА Справочник.СотрудникиОрганизаций)  И
	|		ВзаиморасчетыПоНДФЛ.ВидДвижения = &Приход 
	|
	//----------Выплаты--------------------------------------------------------------------------
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Взаиморасчеты.Организация,
	|		Взаиморасчеты.Сотрудник,
	|		ВЫБОР КОГДА Взаиморасчеты.Регистратор ССЫЛКА Документ.ЗарплатаКВыплатеОрганизаций
	|				ТОГДА ""Задепонировано""
	|			ИНАЧЕ Взаиморасчеты.Ведомость.ВидВыплаты.Наименование
	|		КОНЕЦ,
	|		"""",
	|		"""+НСтр("ru='Всего выплачено';uk='Всього виплачено'", КодЯзыкаПечать)+""",
	|		4,
	|		"+?(УпрУчет,"Взаиморасчеты.СуммаВзаиморасчетовУпр","Взаиморасчеты.СуммаВзаиморасчетов")+"
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Взаиморасчеты
	|	
	|	ГДЕ
	|		(Взаиморасчеты.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ))
	|		И	Взаиморасчеты.ВидДвижения <> &Приход 
	|		И	Взаиморасчеты.Ведомость <> ЗНАЧЕНИЕ(Документ.ЗарплатаКВыплатеОрганизаций.ПустаяСсылка) 
	|	
	|	
	//---------------------Взносы в фонды---------------------------------------------------------
    |		"+?(УпрУчет,"","ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВзносыВФонды.Организация,
	|			ВзносыВФонды.Сотрудник,
	|			ВзносыВФонды.СтатьяНалоговойДекларации,
	|			"""",
	|			"""+НСтр("ru='Всего удержано';uk='Всього утримано'", КодЯзыкаПечать)+""",
	|			5,
	|			СУММА(ВзносыВФонды.Результат)                        
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыПоВзносамВФонды КАК ВзносыВФонды
	|		
	|		ГДЕ
	|			ВзносыВФонды.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	|		  И
	|			ВзносыВФонды.ВидДвижения 		=	&Приход
	|		  И 
	|			ВзносыВФонды.Налог.Родитель = ЗНАЧЕНИЕ(Справочник.Налоги.Взносы)
	|		
	|		{ГДЕ
	|			ВзносыВФонды.Организация КАК Организация}
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВзносыВФонды.Организация,
	|			ВзносыВФонды.Ставка,
    |			ВзносыВФонды.Сотрудник,
	|			ВзносыВФонды.СтатьяНалоговойДекларации
	|                     ")+
	//-------------------------Удержания----------------------------------------------------------
	"
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УдержанияРаботниковОрганизации.Организация 			КАК Организация,
	|		УдержанияРаботниковОрганизации.Сотрудник 					КАК Сотрудник,
	|		УдержанияРаботниковОрганизации.ВидРасчета 					КАК ИмяВидаРасчета,
	|		"""" 														КАК ПриоритетВидаРасчета,
	|		"""+НСтр("ru='Всего удержано';uk='Всього утримано'", КодЯзыкаПечать)+"""	КАК Группа,
	|		6 															КАК ПриоритетГруппы,
	|		"+?(УпрУчет,"УдержанияРаботниковОрганизации.РезультатУпр","УдержанияРаботниковОрганизации.Результат")+"	КАК Результат
	
	|	ИЗ
	|		РегистрРасчета.Удержания КАК УдержанияРаботниковОрганизации
	|	
	|	ГДЕ
	|		(УдержанияРаботниковОрганизации.ПериодРегистрации = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)) И
	|		("+?(УпрУчет,"УдержанияРаботниковОрганизации.РезультатУпр","УдержанияРаботниковОрганизации.Результат")+" <> 0)
	|
	//-------------------------------------------------------------------------------------------
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		СальдоНачальное.Организация,
	|		СальдоНачальное.Сотрудник,
	|		"""+НСтр("ru='Начальное сальдо';uk='Початкове сальдо'", КодЯзыкаПечать)+""",
	|		NULL,
	|		""А"",
	|		1,
	|		"+?(УпрУчет,"СальдоНачальное.СуммаВзаиморасчетовУпрОстаток","СальдоНачальное.СуммаВзаиморасчетовОстаток")+"
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), ) КАК СальдоНачальное
	|	
	//-------------------------------------------------------------------------------------------
	//Дандали В. 17.01.2024 заккоментирвоал по просьбе Васильевой К. т.к. мешает анализу отчета
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Основной.Организация,
	//|		Основной.Сотрудник,
	//|		"""+НСтр("ru='К выплате за месяц';uk='До виплати за місяць'", КодЯзыкаПечать)+""",
	//|		NULL,
	//|		""Я"",
	//|		7,
	//|		ВЫБОР	КОГДА Основной.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|	          		ТОГДА "+?(УпрУчет,"Основной.СуммаВзаиморасчетовУпр","Основной.СуммаВзаиморасчетов")+"
	//|				КОГДА	Основной.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Взносы)
	//|					ИЛИ Основной.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.НДФЛ)
	//|					ИЛИ Основной.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Удержания)
	//|	          		ТОГДА -"+?(УпрУчет,"Основной.СуммаВзаиморасчетовУпр","Основной.СуммаВзаиморасчетов")+"
	//|	          ИНАЧЕ 0
	//|	    КОНЕЦ
	//|	ИЗ	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Основной
	//|	ГДЕ  Основной.ПериодВзаиморасчетов = &Период
	//|	
	//|	
	//-------------------------------------------------------------------------------------------
	//Дандали В. 17.01.2024

	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СальдоКонечное.Организация,
	|		СальдоКонечное.Сотрудник,
	|		"""+НСтр("ru='Конечное сальдо';uk='Кінцеве сальдо'", КодЯзыкаПечать)+""",
	|		NULL,
	|		""Я"",
	|		8,
	|		"+?(УпрУчет,"СальдоКонечное.СуммаВзаиморасчетовУпрОстаток","СальдоКонечное.СуммаВзаиморасчетовОстаток")+"
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(&СледующийПериод, ) КАК СальдоКонечное
	|	
	|	) КАК Данные
	|
	//------------------------подтягиваю подразделение организации-------------------------------
	|		"+?(УпрУчет,"ЛЕВОЕ СОЕДИНЕНИЕ
	|		(	ВЫБРАТЬ
	|				Работники.Подразделение									КАК Подразделение,
	|				Работники.ФизЛицо										КАК ФизЛицо
	|			ИЗ
	|				РегистрСведений.Работники.СрезПоследних(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
	|	                )					КАК Работники
	|		)КАК РаботникиОрганизаций
	|
	|ПО РаботникиОрганизаций.ФизЛицо     = Данные.Сотрудник.ФизЛицо","ЛЕВОЕ СОЕДИНЕНИЕ
	|		(	ВЫБРАТЬ
	|				Работники.ПодразделениеОрганизации						КАК Подразделение,
	|				Работники.Сотрудник										КАК Сотрудник,
	|				Работники.Организация									КАК Организация
	|			ИЗ
	|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
	|	                Сотрудник.ВидЗанятости В (&ПарамОсновнойСотрудник)
	|	                {ПодразделениеОрганизации КАК Подразделение, Организация}
	|	                )					КАК Работники
	|		)КАК РаботникиОрганизаций
	|
	|ПО РаботникиОрганизаций.Сотрудник     = Данные.Сотрудник И
	|   РаботникиОрганизаций.Организация = Данные.Организация
	|")+
	//-------------------------------------------------------------------------------------------
	//--------------------------подтягиваем информацию о физлицах-инвалидах----------------------
	"
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		(	ВЫБРАТЬ
	|				ФизЛицо			КАК ФизЛицо,
	|				Инвалидность	КАК Инвалидность
	|			ИЗ
	|				РегистрСведений.СведенияОбИнвалидностиФизЛиц.СрезПоследних(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ))
	|		) КАК СведенияОбИнвалидностиФизЛиц
	|	ПО Данные.Сотрудник.ФизЛицо = СведенияОбИнвалидностиФизЛиц.ФизЛицо
	//--------------------------------------------------------------------------------------------
	
	//--------------------------подтягиваем информацию о физлицах-пенсионерах[----------------------
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		(	ВЫБРАТЬ
	|				ФизЛицо			КАК ФизЛицо,
	|				Пенсионер		КАК Пенсионер
	|			ИЗ
	|				РегистрСведений.СведенияОПенсионерах.СрезПоследних(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ))
	|		) КАК СведенияОПенсионерах
	|	ПО Данные.Сотрудник.ФизЛицо = СведенияОПенсионерах.ФизЛицо
	//--------------------------------------------------------------------------------------------
	|ГДЕ ИСТИНА
	|	И Данные.Результат > 0
	|	"+?(ТолькоСотрудникиИнвалиды,"И СведенияОбИНвалидностиФизЛиц.Инвалидность","")+"
	|	"+?(ТолькоСотрудникиПенсионеры,"И СведенияОПенсионерах.Пенсионер","")+"
	
	|
	|СГРУППИРОВАТЬ ПО
	|	
	|	Данные.Организация,
	|	"+?(НеВыводитьПодразделение,"","РаботникиОрганизаций.Подразделение,")+"
	|	Данные.Сотрудник,
	|	"+? (Не ВыводитьКодПоДРФО,"","ВЫРАЗИТЬ(""("" + Данные.Сотрудник.Физлицо.КодПоДРФО + "")"" КАК СТРОКА(20)),")+"
	|	Данные.Группа,
	|	Данные.ПриоритетГруппы,
	|	Данные.ИмяВидаРасчета,
	|	Данные.ПриоритетВидаРасчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Данные.Сотрудник.Физлицо.Наименование,
	|	ПриоритетГруппы,
	|	ПриоритетВидаРасчета
	|
	|ИТОГИ МАКСИМУМ(ПриоритетГруппы), МАКСИМУМ(ПриоритетВидаРасчета), СУММА(Результат) ПО
	|	Данные.Организация,
	|	"+?(НеВыводитьПодразделение,"","РаботникиОрганизаций.Подразделение,")+"
	|	Данные.Сотрудник
	|
	|{ИТОГИ  ПО
	|	Данные.Организация,
	|	"+?(НеВыводитьПодразделение,"","РаботникиОрганизаций.Подразделение,")+"
	|	ФизЛицо,
	|	Группа,
	|	ИмяВидаРасчета
	|}
	|
	|{ГДЕ
	|	Данные.Организация,
	|	Данные.Сотрудник,
	|	РаботникиОрганизаций.Подразделение
	|}	
	|";
	

	СтруктураПредставлениеПолей = Новый Структура("ФизЛицоПредставление,Физлицо,ИмяВидаРасчета,Организация",
	НСтр("ru='Работник';uk='Працівник'", КодЯзыкаПечать),
	НСтр("ru='Работник';uk='Працівник'", КодЯзыкаПечать),
	НСтр("ru='Вид расчета';uk='Вид розрахунку'", КодЯзыкаПечать),
	НСтр("ru='Организация';uk='Організація'", КодЯзыкаПечать));
		
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	ПостроительОтчета.Отбор.Добавить("Организация");
	ПостроительОтчета.Отбор.Добавить("Подразделение");
	ПостроительОтчета.Отбор.Добавить("Сотрудник");
	ПостроительОтчета.ВыводитьОбщиеИтоги = Истина;
	
	ПостроительОтчета.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Интерфейс);
	ПостроительОтчета.Макет = ПолучитьМакет("Макет");
	
	ПостроительОтчета.ИзмеренияКолонки.Добавить("Группа");
	ПостроительОтчета.ИзмеренияКолонки.Добавить("ИмяВидаРасчета");
	
	ПостроительОтчета.РазмещениеИзмеренийВКолонках = ТипРазмещенияИзмерений.Вместе;
	ПостроительОтчета.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
	
	ПостроительОтчета.Параметры.Вставить("Приход", ВидДвиженияНакопления.Приход);
	
	ПустаяСтруктура = Новый Структура;
	
КонецПроцедуры

#КонецЕсли
